._design_docs/.test_reports/mtp-jinja-run-20260607-V1/S12-MTP-B01-V1-Jmarked/hybrid/k6-stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: D:\source\llama.cpp-jet\tools\server\tests\bench-cache-correctness.js
        output: json (D:\source\llama.cpp-jet\._design_docs\.test_reports\mtp-jinja-run-20260607-V1\S12-MTP-B01-V1-Jmarked\hybrid\k6-results.json)

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 5m30s max duration (incl. graceful stop):
              * hit_probe: 11 iterations shared among 1 VUs (maxDuration: 5m0s, exec: doProbe, gracefulStop: 30s)
              * warmup: 1 iterations shared among 1 VUs (maxDuration: 2m0s, exec: doWarmup, gracefulStop: 30s)


running (0m01.0s), 1/2 VUs, 1 complete and 0 interrupted iterations
hit_probe   [   0% ] 1 VUs  0m01.0s/5m0s  00/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m02.0s), 1/2 VUs, 2 complete and 0 interrupted iterations
hit_probe   [   9% ] 1 VUs  0m02.0s/5m0s  01/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m03.0s), 1/2 VUs, 3 complete and 0 interrupted iterations
hit_probe   [  18% ] 1 VUs  0m03.0s/5m0s  02/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m04.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
hit_probe   [  27% ] 1 VUs  0m04.0s/5m0s  03/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m05.0s), 1/2 VUs, 6 complete and 0 interrupted iterations
hit_probe   [  45% ] 1 VUs  0m05.0s/5m0s  05/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m06.0s), 1/2 VUs, 7 complete and 0 interrupted iterations
hit_probe   [  55% ] 1 VUs  0m06.0s/5m0s  06/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m07.0s), 1/2 VUs, 8 complete and 0 interrupted iterations
hit_probe   [  64% ] 1 VUs  0m07.0s/5m0s  07/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m08.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
hit_probe   [  82% ] 1 VUs  0m08.0s/5m0s  09/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters

running (0m09.0s), 1/2 VUs, 11 complete and 0 interrupted iterations
hit_probe   [  91% ] 1 VUs  0m09.0s/5m0s  10/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters


  █ THRESHOLDS 

    cache_hit_rate
    ✓ 'rate>=0.0' rate=0.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    prefix_match_rate
    ✓ 'rate>=0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 12      1.260537/s
    checks_succeeded...: 100.00% 12 out of 12
    checks_failed......: 0.00%   0 out of 12

    ✓ warmup 200
    ✓ probe 200

    CUSTOM
    cache_hit_rate.................: 0.00%   0 out of 11
    cache_miss_prompt_ms...........: avg=268.7ms  min=265.17ms med=268.49ms p(95)=273.39ms max=277.92ms
    cache_n_tokens.................: avg=0        min=0        med=0        p(95)=0        max=0       
    prefix_match_rate..............: 100.00% 11 out of 11
    requests_ok....................: 12      1.260537/s

    HTTP
    http_req_duration..............: avg=759.27ms min=682.7ms  med=686.66ms p(95)=1.08s    max=1.55s   
      { expected_response:true }...: avg=759.27ms min=682.7ms  med=686.66ms p(95)=1.08s    max=1.55s   
    http_req_failed................: 0.00%   0 out of 12
    http_reqs......................: 12      1.260537/s

    EXECUTION
    iteration_duration.............: avg=868.21ms min=782.92ms med=787.11ms p(95)=1.23s    max=1.65s   
    iterations.....................: 12      1.260537/s
    vus............................: 1       min=1        max=1
    vus_max........................: 2       min=2        max=2

    NETWORK
    data_received..................: 22 kB   2.3 kB/s
    data_sent......................: 3.1 kB  323 B/s



running (0m09.5s), 0/2 VUs, 12 complete and 0 interrupted iterations
hit_probe ✓ [ 100% ] 1 VUs  0m09.5s/5m0s  11/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.9s/2m0s  1/1 shared iters